CSI API ETABS v1
cAnalysisResultsSetup Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cAnalysisResultsSetup
Public Interface cAnalysisResultsSetup
Dim instance As cAnalysisResultsSetup
public interface class cAnalysisResultsSetup
type cAnalysisResultsSetup =  interface end
The cAnalysisResultsSetup type exposes the following members.
Methods
Name | Description
DeselectAllCasesAndCombosForOutput
 Deselects all load cases and response combinations for output.
GetCaseSelectedForOutput
 Checks if a load case is selected for output.
GetComboSelectedForOutput
 Checks if a load combination is selected for output
GetOptionBaseReactLoc
 Retrieves the global coordinates of the location at which the base reactions are reported
GetOptionBucklingMode
GetOptionDirectHist
 Retrieves the output option for direct history results.
GetOptionModalHist
 Retrieves the output option for modal history results.
GetOptionModeShape
GetOptionMultiStepStatic
GetOptionMultiValuedCombo
GetOptionNLStatic
SetCaseSelectedForOutput
 Sets a load case selected for output flag.
SetComboSelectedForOutput
 Sets a load combination selected for output flag
SetOptionBaseReactLoc
SetOptionBucklingMode
SetOptionDirectHist
SetOptionModalHist
 Sets the output option for modal history results.
SetOptionModeShape
SetOptionMultiStepStatic
SetOptionMultiValuedCombo
SetOptionNLStatic
Top
See Also
Reference
ETABSv1 Namespace